Repository: facsimiles/blackbox
Catalog: po/*.po
Languages: nb

source: Terminal;terminal;shell;prompt;command;commandline;cmd;box;
nb: Terminal;terminal;shell;prompt;command;commandline;cmd;box;kommando;boks;sort;skall;

source: Window width
nb: Vindubredde

source: Window height
nb: Vinduhøyde

source: Whether or not to remember window size
nb: Hvorvidt å huske vindustørrelse

source: Font family and size
nb: Skrifttype og -størrelse

source: Whether the window should inherit terminal theme's colors
nb: Hvorvidt vinduet arver terminalens farger

source: Terminal window background opacity
nb: Terminalvindusbakgrunnsgjennomsiktighet

source: Whether or not tabs should expand to fill tab bar
nb: Hvorvidt faner bør utvides for å fylle fanelinjen

source: Whether the headerbar should be shown or not
nb: Hvorvidt overlinjen skal vises

source: If enabled, the header bar will be colored differently for root and ssh contexts
nb: Om dette er påslått, skal hovedlinjen farges annerledes mens rot- og ssh-kommandoer kjøres

source: Whether or not to display a menu button in the headerbar
nb: Hvorvidt en menyknapp skal vises i hovedlinjen

source: Whether or not to reserve an area for dragging the header bar
nb: Hvorvidt et område skal settes til side for å dra hovedlinjen

source: Whether or not to show scrollbars
nb: Hvorvidt rullefelt skal vises

source: Whether overlay scrolling should be enabled
nb: Hvorvidt overleggsrulling skal være aktivert

source: If enabled, terminals will scroll by pixels instead of rows
nb: Om dette er påslått, skal terminaler rulles etter piksler i stedet for rad

source: If enabled, terminals will render sixel escape sequences
nb: Om dette er påslått, skal terminaler gjengi sixel-sekvenser

source: Scrollback mode
nb: Tilbakerullingsmodus

source: Number of lines stored in scrollback
nb: Antall linjer lagret i tilbakerullingslageret

source: If enabled, floating controls will be shown in headerless mode
nb: Om dette er påslått, skal svevende kontroller vises når hovedlinjen er avslått

source: Hoverable area (in pixels) at the top of the window to trigger floating controls
nb: Område (i piksler) på toppen av vinduet for å vise svevende kontroller

source: Delay time before showing floating controls
nb: Tidsramme før svevende kontroller vises

source: The light color scheme for the terminal
nb: Det lyse skjemaet for terminalen

source: The dark color scheme for the terminal
nb: Det mørke skjemaet for terminalen

source: Style preference
nb: Stilpreferanse

source: Show bold text in bright colors
nb: Vis fet tekst med lyse farger

source: Amount of padding around terminal widgets (top, right, bottom, left)
nb: Mengden av polstring rundt terminalwidgeter

source: Terminal cell width
nb: Terminalcellebredde

source: Terminal cell height
nb: Terminalcellehøyde

source: Terminal bell
nb: Terminalbjelle

source: Cursor shape
nb: Markørform

source: Whether or not the cursor should blink
nb: Hvorvidt markøren skal blinke

source: If enabled, ctrl+c and ctrl+v will work for copy/paste
nb: Om dette er påslått, kan Ctrl + C og Ctrl + V for hhv. kopiering og innliming

source: Whether to spawn shell in login mode
nb: Hvorvidt skallet skal startes i innloggingsmodus

source: Whether to use a custom command instead of the user's shell
nb: Hvorvidt en tilpasset kommando skal brukes i stedet for brukerens skall

source: Custom command to use instead of the user's shell
nb: Tilpasset kommando som skal erstatte brukerens skal

source: Send a desktop notification when a process is completed on an unfocussed tab
nb: Send en varsling når en prosess er fullført på en bakgrunnsfane

source: Working directory mode
nb: Fungerende mappe-modus

source: Custom working directory for new terminals
nb: Tilpasset fungerende mappe for nye terminaler

source: Whether clicking next on the last search result should return to the first
nb: Hvorvidt å klikke Neste på det siste søkresultatet skal gå tilbake til det første

source: Whether search should be case sensitive
nb: Hvorvidt søkeord skal være sensitive for store og små bokstaver

source: Whether search should only match entire words
nb: Hvorvit søkeord skal matche hele ord

source: Whether search should be performed using regular expressions
nb: Hvorvidt søking skal gjennomføres med regulære uttrykk

source: Edit Shortcut
nb: Rediger snarvei

source: Cancel
nb: Avbryt

source: Apply
nb: Bruk

source: This shortcut is already in use
nb: Denne snarveien brukes allerede

source: Press Escape to cancel or Backspace to disable shortcut
nb: Trykk på Esc for å avbryte eller Backspace for å slå av snarveien

source: Keyboard
nb: Tastatur

source: Shortcuts
nb: Tastatursnarveier

source: Reset All Shortcuts
nb: Tilbakestill alle snarveier

source: This will reset all shortcuts to their default keybindings and overwrite your config file.
nb: Dette tilbakestiller alle snarveier til deres standardinnstillinger og overskriver din innstillingsfil.

source: Reset All
nb: Tilbakestill alle

source: Previous result
nb: Forrige resultat

source: Next result
nb: Neste resultat

source: Search wraps around
nb: Søk sløyfer rundt

source: Match is case sensitive
nb: Treff er sensitivt for store og små bokstaver

source: Match entire words only
nb: Matche bare hele ord

source: Match using regular expression
nb: Matche med regulære uttrykk

source: General
nb: Alminnelig

source: Window
nb: Vindu

source: Remember Window Size
nb: Husk vindustørrelse

source: Theme settings have been moved to Terminal > Appearance.
nb: Stilinnstillinger har blitt flyttet til Terminal > Utseende.

source: Tabs
nb: Faner

source: Expand Tabs
nb: Utvid faner

source: Header Bar
nb: Overlinje

source: Show Header Bar
nb: Vis overlinje

source: Context Aware
nb: Årvåken overlinje

source: If enabled, the header bar will be colored differently when the active tab is running ssh or sudo.
nb: Om dette er påslått, skal hovedlinjen farges annerledes mens rot- og ssh-kommandoer kjøres i den fokuserte fanen.

source: Show Menu Button
nb: Vis menyknapp

source: Drag Area
nb: Dragingsområde

source: Enable to reserve some space on the left side to drag the window.
nb: Slå på for å sette til side et område til venstre for å dra vinduet.

source: Floating Controls
nb: Svevende kontroller

source: Show Floating Controls
nb: Vis svevende kontroller

source: Show floating controls when header bar is hidden.
nb: Vis svevende kontroller når hovedlinjen er skjult.

source: Floating Controls Hover Area
nb: Svevingsområde for svevende kontroller

source: Hoverable area (in pixels) at the top of the window to trigger floating controls.
nb: Område (i piksler) på toppen av vinduet for å vise svevende kontroller.

source: Delay Before Show Floating Controls
nb: Tidsramme før svevende kontroller vises

source: Delay time (ms) before show floating controls.
nb: Tidsrammen (i ms) før svevende kontroller vises.

source: Text
nb: Tekst

source: Font
nb: Skrifttype

source: Cell Spacing
nb: Celleavstand

source: Width
nb: Bredde

source: Height
nb: Høyde

source: Bright Bold Text
nb: Lys fet tekst

source: Use bright colors for bold text.
nb: Bruk lyse farger for fet tekst.

source: Easy Copy &amp; Paste
nb: Lett kopiering og innliming

source: Use ctrl+c/ctrl+v for copy/paste.
nb: Bruk Ctrl + C og Ctrl + V for kopiering og innliming.

source: Audible Bell
nb: Hørlig bjelle

source: If enabled, terminals might use an audible bell to indicate events.
nb: Om dette er slått på, kan terminaler bruke en hørlig bjelle for å angi hendelser.

source: Cursor
nb: Markør

source: Adjust cursor shape and behavior.
nb: Juster markørform og -atferd.

source: Cursor Shape
nb: Markørform

source: Block
nb: Blokke

source: Underline
nb: Understrek

source: Cursor Blinking
nb: Markørblinking

source: Whether or not the cursor should blink.
nb: Hvorvidt markøren skal blinke.

source: Follow System
nb: Følg systemet

source: On
nb: På

source: Off
nb: Av

source: Padding
nb: Polstring

source: Opacity
nb: Gjennomsiktighet

source: Terminal background opacity.
nb: Terminalbakgrunnens gjennomsiktighet.

source: Working Directory
nb: Fungerende mappe

source: Previous Session
nb: Forrige økt

source: Home Directory
nb: Hjemmemappe

source: Custom
nb: Tilpasset

source: Custom Working Directory
nb: Tilpasset fungerende mappe

source: Set to user's home
nb: Sette til brukerens hjemmemappe

source: Scrolling
nb: Rulling

source: Scrollbars
nb: Rullefelt

source: Show Scrollbars
nb: Vis rullefelt

source: Use Overlay Scrolling
nb: Bruk overleggsrulling

source: Fixed Size
nb: Fast størrelse

source: Unlimited
nb: Ubegrenset

source: Disabled
nb: Avslått

source: Scrollback Lines
nb: Tilbakerullingslinjer

source: Command
nb: Kommando

source: Run Command as Login Shell
nb: Kjør kommando som innlogging for skallet

source: Use Custom Command
nb: Bruk tilpasset kommando

source: Custom Command
nb: Tilpasset kommando

source: Notification on Completed Task
nb: Varsling når oppgave fullføres

source: Send a desktop notification when a command is completed on an unfocussed tab.
nb: Send en varsling når en kommando fullføres på en bakgrunnsfane.

source: Appearance
nb: Utseende

source: Application Style
nb: Applikasjonstil

source: Light
nb: Lyst

source: Dark
nb: Mørkt

source: Theme Integration
nb: Skjemaintegrering

source: Paint the whole app with colors from your colorscheme.
nb: Bruk fargene fra fargeskjemaet ditt overalt.

source: Theme
nb: Stil

source: Set your preferred theme for light and dark styles.
nb: Still inn skjemaet som skal brukes for den lyse og den mørke stilen.

source: Open themes folder
nb: Åpne skjemamappen

source: Get more themes online
nb: Skaff flere skjema online

source: Light Theme
nb: Lys stil

source: Dark Theme
nb: Mørk stil

source: Only display themes for the current style
nb: Vis bare skjema for den nåværende stilen

source: To ensure readability, "Theme Integration" will be disabled if you select a light color scheme while using the dark app style or a dark color scheme while using the light app style.
nb: For å forsikre at tekst kan leses, skal skjemaintegrering bli avslått dersom du velger et lyst skjema mens du bruker den mørke stilen eller vice versa.

source: Advanced
nb: Avansert

source: Experimental
nb: Eksperimentell

source: Features in this section are known to be unstable. Please feel free to test and <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">report bugs</a>.
nb: Funksjoner i dette avsnittet er kjent å være ustabile. Føl deg fri å teste dem og <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">rapportere feil</a>.

source: Sixel Support
nb: Sixelstøtte

source: Render sixel escape sequences.
nb: Gjengi sixel-sekvenser.

source: The VTE build you are using does not have support Sixel. Sixel is still an experimental feature in VTE. For this reason, most distros do not build VTE with Sixel support. Installing Black Box via Flatpak will enable this feature. <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues/273">See discussion in issue tracker.</a>
nb: VTE-byggen du bruker støtter ikke Sixel. Sixel er fortsatt en eksperimentell funksjon i VTE, og dermed bygger ikke de fleste distroene VTE med Sixel-støtte. Å installere Sortboks med Flatpak skal slå på denne funksjonen. <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues/273">Vis diskuteringen om dette.</a>

source: Danger Zone
nb: Faresonen

source: Reset Preferences
nb: Tilbakestill innstillinger

source: This will revert all settings back to default. Your extra themes will not be removed.
nb: Dette tilbakestiller alle innstillinger. Dine skjema skal ikke fjernes.

source: Reset preferences
nb: Tilbakestille innstillinger

source: Open Link
nb: Åpne lenke

source: New Tab
nb: Ny fane

source: New Window
nb: Nytt vindu

source: Copy
nb: Kopier

source: Copy Link
nb: Kopier lenke

source: Paste
nb: Lim inn

source: Preferences
nb: Innstillinger

source: Keyboard Shortcuts
nb: Tastatursnarveier

source: About Black Box
nb: Om Sortboks

# shortcut window
source: Window
nb: Vindu

# shortcut window
source: New window
nb: Nytt vindu

# shortcut window
source: New tab
nb: Ny fane

# shortcut window
source: Close tab
nb: Steng fane

# shortcut window
source: Rename tab
nb: Endre navn på fanen

# shortcut window
source: Switch headbar mode
nb: Veksle overlinjemodus

# shortcut window
source: Toggle fullscreen
nb: Veksle fullskjermmodus

# shortcut window
source: Search
nb: Søk

# shortcut window
source: Copy
nb: Kopier

# shortcut window
source: Paste
nb: Lim inn

# shortcut window
source: Zoom in
nb: Zoome inn

# shortcut window
source: Zoom out
nb: Zoome ut

# shortcut window
source: Reset zoom
nb: Tilbakestille zoom

# shortcut window
source: Navigation
nb: Navigering

# shortcut window
source: Focus next tab
nb: Fokuser neste fane

# shortcut window
source: Focus previous tab
nb: Fokuser forrige fane

# shortcut window
source: Switch to Tab 1
nb: Bytt til fane én

# shortcut window
source: Switch to Tab 2
nb: Bytt til fane to

# shortcut window
source: Switch to Tab 3
nb: Bytt til fane tre

# shortcut window
source: Switch to Tab 4
nb: Bytt til fane fire

# shortcut window
source: Switch to Tab 5
nb: Bytt til fane fem

# shortcut window
source: Switch to Tab 6
nb: Bytt til fane seks

# shortcut window
source: Switch to Tab 7
nb: Bytt til fane syv

# shortcut window
source: Switch to Tab 8
nb: Bytt til fane åtte

# shortcut window
source: Switch to Tab 9
nb: Bytt til fane ni

# shortcut window
source: Switch to last Tab
nb: Bytt til siste fane

# shortcut window
source: General
nb: Alminnelig

# shortcut window
source: Show Shortcuts
nb: Vis tastatursnarveier

# shortcut window
source: Edit Preferences
nb: Rediger innstillinger

source: Move Tab Left
nb: Flytt fane til venstre

source: Move Tab Right
nb: Flytt fane til høyre

source: Rename Tab
nb: Endre navn på fane

source: Move Tab to New Window
nb: Flytt fane til nytt vindu

source: Close Tab
nb: Steng fane

source: Remote Access
nb: Fjerntilgang

source: SSH Connections
nb: SSH-tilkoblinger

source: New Connection
nb: Ny tilkobling

source: SFTP Servers
nb: SFTP-servere

source: Show All Tabs
nb: Vis alle faner

source: Fullscreen
nb: Fullskjermmodus

source: Exit Fullscreen
nb: Forlat fullskjermmodus

source: Menu
nb: Meny

source: Use System Colors
nb: Bruk systemfarger

source: Use Light Colors
nb: Bruk lyse farger

source: Use Dark Colors
nb: Bruk mørke farger

source: Replace keybinding?
nb: Erstatt snarvei?

source: %s is already assigned to %s
nb: %s brukes allerede for %s

source: You can still access the menu by right-clicking any terminal.
nb: Du kan fortsatt nå menyen ved å høyreklikke på terminalen.

source: %s uses an early Gtk 4 port of VTE as a terminal widget. While a lot of progress has been made on this port, copying has yet to be implemented. This means there's currently no way to copy text in %s.
nb: %s bruker en tidlig Gtk4-omsetting av VTE som terminalwidgeten. Mens det er gjort store fremskritt, er det foreløpig ikke mulig å kopiere tekst fra den, og dermed er det umulig å kopiere tekst fra %s.

source: Warning: unlimited scrollback saves content to disk, which may cause your system to run out of storage.
nb: Advarsel: Ubegrenset tilbakeskrolling lagrer innhold til disken, som kan forårsake en full disk.

source: No
nb: Nei

source: Yes
nb: Ja

source: Keep
nb: Behold

source: Replace
nb: Erstatt

source: Close
nb: Steng

source: Close Tab?
nb: Steng fane?

source: Close Window?
nb: Steng vindu?

source: Some commands are still running. Closing this tab will kill them and may lead to unexpected outcomes.
nb: Noen kommandoer kjører fortsatt. Å stenge denne fanen skal døde dem og kan medføre uforventede konsekvenser.

source: Some commands are still running. Closing this window will kill them and may lead to unexpected outcomes.
nb: Noen kommandoer kjører fortsatt. Å stenge dette vinduet skal døde dem og kan medføre uforventede konsekvenser.

source: invalid keybinding
nb: Ugyldig tastatursnarvei

source: Donate
nb: Doner

source: Full Changelog
nb: Full endringslogg

source: Terminal Font
nb: Terminalskrifttype

source: Reuse previous tab's directory.
nb: Bruk igjen den forrige fanens mappe

source: Use the current user's home as working directory.
nb: Bruk den nåværende brukerens hjemmemappe som fungerende mappe

source: Use a custom path as working directory.
nb: Bruk tilpasset søkesti som fungerende mappe

source: Enter new shortcut
nb: Tast inn ny snarvei

source: Enter new shortcut for "%s"
nb: Tast inn ny snarvei for «%s»

source: Add Keybinding
nb: Legg til snarvei

source: Reset Keybindings
nb: Tilbakestill snarveier

source: Remove %s
nb: Fjern %s

source: Focus Next Tab
nb: Fokuser neste fane

source: Focus Previous Tab
nb: Fokuser forrige fane

source: Toggle Header Bar
nb: Slå på/av hovedlinje

source: Search
nb: Søk

source: Zoom In
nb: Zoom inn

source: Zoom Out
nb: Zoom ut

source: Reset Zoom
nb: Tilbakestill zoom

source: Switch to Tab %u
nb: Bytt til fane %u

source: Switch to Last Tab
nb: Bytt til siste fane

source: This will reset all shortcuts to default and overwrite your config file. This action is irreversible.
nb: Dette tilbakestiller alle snarveier til deres standarde innstillinger og overskriver innstillingsfilen din. Dette kan ikke angres.

source: tab
nb: fane

source: Error
nb: Feil

source: Set a custom title for this tab
nb: Still inn et tilpasset navn for denne fanen

source: Enter a custom tab title
nb: Tast inn et tilpasset fanenavn

source: Reset Title
nb: Tilbakestill navn

source: Set Title
nb: Bruk navn

source: Command completed
nb: Kommando fullført

source: Show app version
nb: Vis appversjon

source: Set current working directory
nb: Still inn nåværende fungerende mappe

source: Execute command in a terminal
nb: Kjør kommando i en terminal

source: Show help
nb: Vis hjelp

source: Run %s --help to get help
nb: Kjør %s --help for å få hjelp
